TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СоответствиеОбъектовWarehouse/гкс_СоответствиеОбъектовWarehouse.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СоответствиеОбъектовWarehouse</name>
  <resources>
    <name>СсылкаИБ</name>
    <type>
      <types>DefinedType.гкс_WarehouseСинхронизируемыеСсылки</types>
    </type>
  </resources>
  <dimensions>
    <name>СсылкаWarehouse</name>
    <type>
      <types>DefinedType.гкс_WarehouseСправочники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СоответствиеОбъектовWarehouse/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс

// Получает ссылку подсистемы Warehouse соотвествующую ссылке на объект.
// 
// Параметры:
//  СсылкаНаОбъект - ссылка на объект информационной базы.
//
// Возвращаемое значение:
//  	ЛюбаяСсылка - ссылка на объект подситестемы Warehouse.
//
Функция СсылкаWarehouseПоСсылкеОбъекта(СсылкаНаОбъект) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СоответствиеОбъектовWarehouse.СсылкаWarehouse КАК СсылкаWarehouse
		|ИЗ
		|	РегистрСведений.гкс_СоответствиеОбъектовWarehouse КАК СоответствиеОбъектовWarehouse
		|ГДЕ
		|	СоответствиеОбъектовWarehouse.СсылкаИБ = &СсылкаНаОбъект";
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.СсылкаWarehouse;
	Иначе
		Результат = Неопределено;	
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Получает ссылку объекта соотвествующую ссылке подсистемы Warehouse.
// 
// Параметры:
//  СсылкаWarehouse - ссылка на объект подситестемы Warehouse
//
// Возвращаемое значение:
//  СсылкаНаОбъект - ЛюбаяСсылка - ссылка объекта.
//
Функция СсылкаОбъектаПоСсылкеWarehouse(СсылкаWarehouse) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СоответствиеОбъектовWarehouse.СсылкаИБ КАК СсылкаИБ
		|ИЗ
		|	РегистрСведений.гкс_СоответствиеОбъектовWarehouse КАК СоответствиеОбъектовWarehouse
		|ГДЕ
		|	СоответствиеОбъектовWarehouse.СсылкаWarehouse = &СсылкаWarehouse";
	
	Запрос.УстановитьПараметр("СсылкаWarehouse", СсылкаWarehouse);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.СсылкаИБ;
	Иначе
		Результат = Неопределено;	
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Процедура УстановитьСоответствие(СсылкаWarehouse, СсылкаИБ) Экспорт
	
	Если ЗначениеЗаполнено(СсылкаИБ)
		И ЗначениеЗаполнено(СсылкаWarehouse) Тогда
		
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("СсылкаWarehouse", СсылкаWarehouse);
		ЗначенияЗаполнения.Вставить("СсылкаИБ", СсылкаИБ);
					
		гкс_ОбменДаннымиСервер.ДобавитьЗаписьВРегистрСведений(ЗначенияЗаполнения, 
			"гкс_СоответствиеОбъектовWarehouse", Истина);
		
	КонецЕсли;
	
КонецПроцедуры	

// Возращает струтуру записи регистра
//
// Возвращаемое значение:
//  Структура - наименования измерений регистра.
//
Функция СтруктураЗаписи() Экспорт
   	
	Возврат ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(СоздатьМенеджерЗаписи(), 
			Метаданные.РегистрыСведений.гкс_СоответствиеОбъектовWarehouse);
    
КонецФункции

#КонецОбласти

#КонецЕсли
